0wQ/ch32x035-usb-wchlink/third_party/cherryusb_port/usb_ch32x035_dc_usbfs.c
/*
 * CherryUSB device-controller port for the CH32X035 USBFS peripheral.
 *
 * This implementation follows the CH32X035 register and DMA layout directly.
 * In particular, EP4 shares UEP0_DMA, while EP1-3 and EP5-7 each use one DMA
 * base with OUT at offset 0 and IN at offset 64 when both directions are open.
 */
#include "usb_ch32x035_dc_usbfs.h"

#include <stddef.h>
#include <stdint.h>
#include <string.h>

#include <ch32x035.h>
#include <ch32x035_usb.h>
#include <usbd_core.h>

#ifdef CONFIG_USB_HS
#error "CH32X035 only provides a USB full-speed device controller"
#endif

#ifndef CONFIG_CH32X035_USBFS_ZERO_COPY
#define CONFIG_CH32X035_USBFS_ZERO_COPY 1
#endif

#define X035_ALWAYS_INLINE       static inline __attribute__((always_inline))
#define X035_USBFS_IRQ_ATTR      __attribute__((interrupt("WCH-Interrupt-fast")))
#define X035_USBFS_HIGHCODE_ATTR __attribute__((section(".highcode")))

#define X035_USB_EP_COUNT          8u
#define X035_USB_EP_MPS            64u
#define X035_USB_EP0_4_BUFFER_SIZE (X035_USB_EP_MPS * 3u)
#define X035_USB_EP_BUFFER_SIZE    (X035_USB_EP_MPS * 2u)
#define X035_USB_SRAM_START        ((uintptr_t)0x20000000u)
#define X035_USB_SRAM_END          ((uintptr_t)0x20005000u)

#define X035_USB_TX_CTRL_MASK (USBFS_UEP_T_AUTO_TOG | USBFS_UEP_T_TOG | USBFS_UEP_T_RES_MASK)
#define X035_USB_RX_CTRL_MASK (USBFS_UEP_R_AUTO_TOG | USBFS_UEP_R_TOG | USBFS_UEP_R_RES_MASK)

typedef struct {
    uint16_t mps;
    uint8_t type;
    bool enabled;
    bool stalled;
    bool active;
    bool dma_direct;
    bool accept_toggle_mismatch;
    uint8_t *buffer;
    uint32_t remaining;
    uint32_t transferred;
    uint16_t packet_len;
} x035_usb_ep_state_t;

typedef struct {
    struct usb_setup_packet setup;
    uint8_t pending_address;
    bool address_pending;
    bool ep0_rx_toggle;
    bool ep0_tx_toggle;
    x035_usb_ep_state_t in_ep[X035_USB_EP_COUNT];
    x035_usb_ep_state_t out_ep[X035_USB_EP_COUNT];
    __attribute__((aligned(4))) uint8_t ep0_4_buffer[X035_USB_EP0_4_BUFFER_SIZE];
    __attribute__((aligned(4))) uint8_t ep_buffer[6u][X035_USB_EP_BUFFER_SIZE];
} x035_usb_dcd_t;

static x035_usb_dcd_t s_dcd;

static bool x035_usb_bus_valid(uint8_t busid) {
    return busid == 0u;
}

static bool x035_usb_ep_valid(uint8_t ep_idx) {
    return ep_idx < X035_USB_EP_COUNT;
}

// CH32X035 仅在 endpoint 1/2/3 上提供硬件自动 data toggle
static bool x035_usb_auto_toggle_supported(uint8_t ep_idx) {
    return ep_idx >= 1u && ep_idx <= 3u;
}

static uint8_t x035_usb_ep_slot(uint8_t ep_idx) {
    switch (ep_idx) {
        case 1u: return 0u;
        case 2u: return 1u;
        case 3u: return 2u;
        case 5u: return 3u;
        case 6u: return 4u;
        default: return 5u;
    }
}

static volatile uint32_t *x035_usb_dma_reg(uint8_t ep_idx) {
    switch (ep_idx) {
        case 0u:
        case 4u: return &USBFSD->UEP0_DMA;
        case 1u: return &USBFSD->UEP1_DMA;
        case 2u: return &USBFSD->UEP2_DMA;
        case 3u: return &USBFSD->UEP3_DMA;
        case 5u: return &USBFSD->UEP5_DMA;
        case 6u: return &USBFSD->UEP6_DMA;
        default: return &USBFSD->UEP7_DMA;
    }
}

static volatile uint16_t *x035_usb_tx_len_reg(uint8_t ep_idx) {
    switch (ep_idx) {
        case 0u: return &USBFSD->UEP0_TX_LEN;
        case 1u: return &USBFSD->UEP1_TX_LEN;
        case 2u: return &USBFSD->UEP2_TX_LEN;
        case 3u: return &USBFSD->UEP3_TX_LEN;
        case 4u: return &USBFSD->UEP4_TX_LEN;
        case 5u: return &USBFSD->UEP5_TX_LEN;
        case 6u: return &USBFSD->UEP6_TX_LEN;
        default: return &USBFSD->UEP7_TX_LEN;
    }
}

static volatile uint16_t *x035_usb_ctrl_reg(uint8_t ep_idx) {
    switch (ep_idx) {
        case 0u: return &USBFSD->UEP0_CTRL_H;
        case 1u: return &USBFSD->UEP1_CTRL_H;
        case 2u: return &USBFSD->UEP2_CTRL_H;
        case 3u: return &USBFSD->UEP3_CTRL_H;
        case 4u: return &USBFSD->UEP4_CTRL_H;
        case 5u: return &USBFSD->UEP5_CTRL_H;
        case 6u: return &USBFSD->UEP6_CTRL_H;
        default: return &USBFSD->UEP7_CTRL_H;
    }
}

static volatile uint8_t *x035_usb_mode_reg(uint8_t ep_idx) {
    if (ep_idx == 1u || ep_idx == 4u) {
        return &USBFSD->UEP4_1_MOD;
    }
    if (ep_idx == 2u || ep_idx == 3u) {
        return &USBFSD->UEP2_3_MOD;
    }
    return &USBFSD->UEP567_MOD;
}

static uint8_t x035_usb_rx_mode_mask(uint8_t ep_idx) {
    static const uint8_t masks[X035_USB_EP_COUNT] = {
        0u, USBFS_UEP1_RX_EN, USBFS_UEP2_RX_EN, USBFS_UEP3_RX_EN,
        USBFS_UEP4_RX_EN, USBFS_UEP5_RX_EN, USBFS_UEP6_RX_EN, USBFS_UEP7_RX_EN};

    return masks[ep_idx];
}

static uint8_t x035_usb_tx_mode_mask(uint8_t ep_idx) {
    static const uint8_t masks[X035_USB_EP_COUNT] = {
        0u, USBFS_UEP1_TX_EN, USBFS_UEP2_TX_EN, USBFS_UEP3_TX_EN,
        USBFS_UEP4_TX_EN, USBFS_UEP5_TX_EN, USBFS_UEP6_TX_EN, USBFS_UEP7_TX_EN};

    return masks[ep_idx];
}

static uint8_t x035_usb_buffer_mode_mask(uint8_t ep_idx) {
    switch (ep_idx) {
        case 1u: return USBFS_UEP1_BUF_MOD;
        case 2u: return USBFS_UEP2_BUF_MOD;
        case 3u: return USBFS_UEP3_BUF_MOD;
        default: return 0u;
    }
}

X035_ALWAYS_INLINE uint8_t x035_usb_get_tx_ctrl(uint8_t ep_idx) {
    return (uint8_t)(*x035_usb_ctrl_reg(ep_idx) & X035_USB_TX_CTRL_MASK);
}

X035_ALWAYS_INLINE uint8_t x035_usb_get_rx_ctrl(uint8_t ep_idx) {
    return (uint8_t)(*x035_usb_ctrl_reg(ep_idx) & X035_USB_RX_CTRL_MASK);
}

X035_ALWAYS_INLINE uint32_t x035_usb_irq_save(void) {
    uint32_t state;
    uint32_t mask = 0x88u;

    __asm__ volatile("csrrc %0, 0x800, %1" : "=r"(state) : "r"(mask) : "memory");
    __asm__ volatile("fence.i" ::: "memory");
    return state & mask;
}

X035_ALWAYS_INLINE void x035_usb_irq_restore(uint32_t state) {
    __asm__ volatile("csrs 0x800, %0" : : "r"(state) : "memory");
}

X035_ALWAYS_INLINE void x035_usb_set_tx_ctrl(uint8_t ep_idx, uint8_t value) {
    volatile uint16_t *ctrl = x035_usb_ctrl_reg(ep_idx);
    uint32_t irq_state = x035_usb_irq_save();
    uint16_t current = *ctrl;

    // IN 和 OUT 控制位共享同一寄存器，原子更新避免主循环与 USB 中断互相覆盖 toggle
    *ctrl = (current & (uint16_t)~X035_USB_TX_CTRL_MASK) | (value & X035_USB_TX_CTRL_MASK);
    x035_usb_irq_restore(irq_state);
}

X035_ALWAYS_INLINE void x035_usb_set_rx_ctrl(uint8_t ep_idx, uint8_t value) {
    volatile uint16_t *ctrl = x035_usb_ctrl_reg(ep_idx);
    uint32_t irq_state = x035_usb_irq_save();
    uint16_t current = *ctrl;

    *ctrl = (current & (uint16_t)~X035_USB_RX_CTRL_MASK) | (value & X035_USB_RX_CTRL_MASK);
    x035_usb_irq_restore(irq_state);
}

X035_ALWAYS_INLINE void x035_usb_dma_fence(void) {
#ifdef X035_USBFS_PORT_TEST
    __asm__ volatile("" ::: "memory");
#else
    __asm__ volatile("fence iorw, iorw" ::: "memory");
#endif
}

X035_ALWAYS_INLINE uint32_t x035_usb_min(uint32_t left, uint32_t right) {
    return left < right ? left : right;
}

