0wQ/ch32x035-usb-wchlink/third_party/cherryusb_port/usb_ch32x035_dc_usbfs.c
X035_ALWAYS_INLINE void x035_usb_set_rx_response(uint8_t ep_idx, uint8_t response) {
    x035_usb_set_rx_ctrl(ep_idx, (x035_usb_get_rx_ctrl(ep_idx) & (uint8_t)~USBFS_UEP_R_RES_MASK) | response);
}

X035_ALWAYS_INLINE void x035_usb_set_tx_response(uint8_t ep_idx, uint8_t response) {
    x035_usb_set_tx_ctrl(ep_idx, (x035_usb_get_tx_ctrl(ep_idx) & (uint8_t)~USBFS_UEP_T_RES_MASK) | response);
}

static bool x035_usb_mode_enabled(uint8_t ep_idx, bool in) {
    uint8_t mask = in ? x035_usb_tx_mode_mask(ep_idx) : x035_usb_rx_mode_mask(ep_idx);
    return (*x035_usb_mode_reg(ep_idx) & mask) != 0u;
}

static void x035_usb_set_mode(uint8_t ep_idx, bool in, bool enable) {
    volatile uint8_t *reg = x035_usb_mode_reg(ep_idx);
    uint8_t mask = in ? x035_usb_tx_mode_mask(ep_idx) : x035_usb_rx_mode_mask(ep_idx);
    uint8_t value = *reg & (uint8_t)~x035_usb_buffer_mode_mask(ep_idx);

    *reg = enable ? (value | mask) : (value & (uint8_t)~mask);
}

static uint8_t *x035_usb_owned_buffer(uint8_t ep_idx, bool in) {
    if (ep_idx == 0u) {
        return s_dcd.ep0_4_buffer;
    }
    if (ep_idx == 4u) {
        uint32_t offset = X035_USB_EP_MPS;
        if (in && x035_usb_mode_enabled(4u, false)) {
            offset += X035_USB_EP_MPS;
        }
        return s_dcd.ep0_4_buffer + offset;
    }

    return s_dcd.ep_buffer[x035_usb_ep_slot(ep_idx)] +
           ((in && x035_usb_mode_enabled(ep_idx, false)) ? X035_USB_EP_MPS : 0u);
}

static void x035_usb_restore_dma(uint8_t ep_idx) {
    uint8_t *buffer = ep_idx == 0u || ep_idx == 4u
                          ? s_dcd.ep0_4_buffer
                          : s_dcd.ep_buffer[x035_usb_ep_slot(ep_idx)];

    *x035_usb_dma_reg(ep_idx) = (uint32_t)(uintptr_t)buffer;
    x035_usb_dma_fence();
}

static void x035_usb_restore_setup_dma(void) {
    *x035_usb_dma_reg(0u) = (uint32_t)(uintptr_t)&s_dcd.setup;
    x035_usb_dma_fence();
}

static bool x035_usb_sram_range(const void *buffer, uint32_t length) {
#if CONFIG_CH32X035_USBFS_ZERO_COPY && !defined(X035_USBFS_PORT_TEST)
    uintptr_t address = (uintptr_t)buffer;

    return address >= X035_USB_SRAM_START && address <= X035_USB_SRAM_END &&
           length <= (uint32_t)(X035_USB_SRAM_END - address);
#else
    (void)buffer;
    (void)length;
    return false;
#endif
}

static uint8_t x035_usb_ready_response(const x035_usb_ep_state_t *state, bool in) {
    if (state->type == USB_ENDPOINT_TYPE_ISOCHRONOUS) {
        return in ? USBFS_UEP_T_RES_NONE : USBFS_UEP_R_RES_NONE;
    }
    return in ? USBFS_UEP_T_RES_ACK : USBFS_UEP_R_RES_ACK;
}

static bool x035_usb_transaction_ok(const x035_usb_ep_state_t *state, uint8_t intst) {
    return state->type == USB_ENDPOINT_TYPE_ISOCHRONOUS || (intst & USBFS_UIS_TOG_OK) != 0u;
}

static void x035_usb_reset_transfer(x035_usb_ep_state_t *state) {
    state->active = false;
    state->dma_direct = false;
    state->buffer = NULL;
    state->remaining = 0u;
    state->transferred = 0u;
    state->packet_len = 0u;
}

static void x035_usb_compact_mode(uint8_t ep_idx) {
    bool changed = false;

    if (!s_dcd.in_ep[ep_idx].enabled && !s_dcd.out_ep[ep_idx].active &&
        x035_usb_mode_enabled(ep_idx, true)) {
        x035_usb_set_mode(ep_idx, true, false);
        changed = true;
    }
    if (!s_dcd.out_ep[ep_idx].enabled && !s_dcd.in_ep[ep_idx].active &&
        x035_usb_mode_enabled(ep_idx, false)) {
        x035_usb_set_mode(ep_idx, false, false);
        changed = true;
    }
    if (changed) {
        x035_usb_restore_dma(ep_idx);
    }
}

static void x035_usb_reset_endpoint_registers(void) {
    USBFSD->UEP4_1_MOD = 0u;
    USBFSD->UEP2_3_MOD = 0u;
    USBFSD->UEP567_MOD = 0u;

    for (uint8_t ep_idx = 0u; ep_idx < X035_USB_EP_COUNT; ++ep_idx) {
        uint8_t auto_toggle = x035_usb_auto_toggle_supported(ep_idx)
                                  ? USBFS_UEP_T_AUTO_TOG
                                  : 0u;

        *x035_usb_tx_len_reg(ep_idx) = 0u;
        x035_usb_set_tx_ctrl(ep_idx, auto_toggle | USBFS_UEP_T_RES_NAK);
        x035_usb_set_rx_ctrl(ep_idx, auto_toggle | USBFS_UEP_R_RES_NAK);
    }
}

static void x035_usb_setup_dma_buffers(void) {
    static const uint8_t dma_endpoints[] = {0u, 1u, 2u, 3u, 5u, 6u, 7u};

    for (uint8_t i = 0u; i < sizeof(dma_endpoints); ++i) {
        if (dma_endpoints[i] == 0u) {
            x035_usb_restore_setup_dma();
        } else {
            x035_usb_restore_dma(dma_endpoints[i]);
        }
    }
}

static void x035_usb_arm_setup(void) {
    x035_usb_reset_transfer(&s_dcd.in_ep[0]);
    x035_usb_reset_transfer(&s_dcd.out_ep[0]);
    x035_usb_restore_setup_dma();
    *x035_usb_tx_len_reg(0u) = 0u;
    x035_usb_set_tx_ctrl(0u, USBFS_UEP_T_RES_NAK);
    x035_usb_set_rx_ctrl(0u, USBFS_UEP_R_RES_ACK);
    s_dcd.ep0_rx_toggle = true;
    s_dcd.ep0_tx_toggle = true;
}

static void x035_usb_load_in_packet(uint8_t ep_idx) X035_USBFS_HIGHCODE_ATTR __attribute__((noinline));
static void x035_usb_load_in_packet(uint8_t ep_idx) {
    x035_usb_ep_state_t *state = &s_dcd.in_ep[ep_idx];
    uint32_t count = x035_usb_min(state->remaining, state->mps);
    bool direct = ep_idx != 4u && count != 0u && !x035_usb_mode_enabled(ep_idx, false) &&
                  (((uintptr_t)state->buffer & 3u) == 0u) && x035_usb_sram_range(state->buffer, count);

    state->packet_len = (uint16_t)count;
    state->dma_direct = direct;
    if (direct) {
        *x035_usb_dma_reg(ep_idx) = (uint32_t)(uintptr_t)state->buffer;
    } else {
        uint8_t *target = x035_usb_owned_buffer(ep_idx, true);
        x035_usb_restore_dma(ep_idx);
        if (count != 0u) {
            memcpy(target, state->buffer, count);
        }
    }
    *x035_usb_tx_len_reg(ep_idx) = (uint16_t)count;
    x035_usb_dma_fence();
    x035_usb_set_tx_response(ep_idx, x035_usb_ready_response(state, true));
}

static void x035_usb_arm_out_packet(uint8_t ep_idx) X035_USBFS_HIGHCODE_ATTR __attribute__((noinline));
static void x035_usb_arm_out_packet(uint8_t ep_idx) {
    x035_usb_ep_state_t *state = &s_dcd.out_ep[ep_idx];
    bool direct = ep_idx != 4u && state->remaining >= state->mps && !x035_usb_mode_enabled(ep_idx, true) &&
                  (((uintptr_t)state->buffer & 3u) == 0u) && x035_usb_sram_range(state->buffer, state->mps);

