0wQ/ch32x035-usb-wchlink/third_party/cherryusb_port/usb_ch32x035_dc_usbfs.c
    state->dma_direct = direct;
    if (direct) {
        *x035_usb_dma_reg(ep_idx) = (uint32_t)(uintptr_t)state->buffer;
        x035_usb_dma_fence();
    } else {
        x035_usb_restore_dma(ep_idx);
    }
    x035_usb_set_rx_response(ep_idx, x035_usb_ready_response(state, false));
}

static void x035_usb_complete_noncontrol_out(uint8_t busid, uint8_t ep_idx, uint8_t intst) {
    x035_usb_ep_state_t *state = &s_dcd.out_ep[ep_idx];
    uint16_t packet_len = USBFSD->RX_LEN;
    uint32_t copy_len;
    bool complete;
    bool toggle_mismatch;

    if (!state->enabled || !state->active) {
        return;
    }
    toggle_mismatch = !x035_usb_transaction_ok(state, intst) &&
                      state->accept_toggle_mismatch;
    if (!x035_usb_transaction_ok(state, intst) && !toggle_mismatch) {
        return;
    }

    x035_usb_set_rx_response(ep_idx, USBFS_UEP_R_RES_NAK);
    if (state->type != USB_ENDPOINT_TYPE_ISOCHRONOUS && !toggle_mismatch &&
        !x035_usb_auto_toggle_supported(ep_idx)) {
        x035_usb_set_rx_ctrl(ep_idx, x035_usb_get_rx_ctrl(ep_idx) ^ USBFS_UEP_R_TOG);
    }
    state->accept_toggle_mismatch = false;

    if (packet_len > state->mps) {
        packet_len = state->mps;
    }
    copy_len = x035_usb_min(packet_len, state->remaining);
    if (!state->dma_direct && copy_len != 0u) {
        memcpy(state->buffer, x035_usb_owned_buffer(ep_idx, false), copy_len);
    }
    state->buffer += copy_len;
    state->remaining -= copy_len;
    state->transferred += copy_len;
    state->dma_direct = false;

    complete = packet_len < state->mps || state->remaining == 0u || copy_len != packet_len;
    if (complete) {
        uint32_t transferred = state->transferred;

        state->active = false;
        state->buffer = NULL;
        state->remaining = 0u;
        state->packet_len = 0u;
        x035_usb_compact_mode(ep_idx);
        usbd_event_ep_out_complete_handler(busid, ep_idx, transferred);
        return;
    }

    x035_usb_arm_out_packet(ep_idx);
}

static void x035_usb_complete_noncontrol_in(uint8_t busid, uint8_t ep_idx, uint8_t intst) {
    x035_usb_ep_state_t *state = &s_dcd.in_ep[ep_idx];

    /* X035 IN 完成中断不保证报告 TOG_OK */
    if (!state->enabled || !state->active || state->packet_len > state->remaining) {
        return;
    }

    x035_usb_set_tx_response(ep_idx, USBFS_UEP_T_RES_NAK);
    state->buffer += state->packet_len;
    state->remaining -= state->packet_len;
    state->transferred += state->packet_len;
    state->packet_len = 0u;
    state->dma_direct = false;
    if (state->type != USB_ENDPOINT_TYPE_ISOCHRONOUS &&
        !x035_usb_auto_toggle_supported(ep_idx)) {
        x035_usb_set_tx_ctrl(ep_idx, x035_usb_get_tx_ctrl(ep_idx) ^ USBFS_UEP_T_TOG);
    }
    if (state->remaining != 0u) {
        x035_usb_load_in_packet(ep_idx);
        return;
    }

    {
        uint32_t transferred = state->transferred;

        state->active = false;
        state->buffer = NULL;
        x035_usb_compact_mode(ep_idx);
        usbd_event_ep_in_complete_handler(busid, ep_idx | 0x80u, transferred);
    }
}

static void x035_usb_complete_ep0_in(uint8_t busid, uint8_t intst) {
    x035_usb_ep_state_t *state = &s_dcd.in_ep[0];
    uint32_t completed;

    (void)intst;

    /* X035 EP0 IN completion is valid even when TOG_OK is not reported. */
    if (!state->active || state->packet_len > state->remaining) {
        return;
    }

    x035_usb_set_tx_response(0u, USBFS_UEP_T_RES_NAK);
    completed = state->packet_len;
    state->active = false;
    state->buffer = NULL;
    state->remaining = 0u;
    state->packet_len = 0u;
    s_dcd.ep0_tx_toggle = completed == state->mps ? !s_dcd.ep0_tx_toggle : true;

    if (s_dcd.address_pending) {
        USBFSD->DEV_ADDR = (USBFSD->DEV_ADDR & USBFS_UDA_GP_BIT) | s_dcd.pending_address;
        s_dcd.address_pending = false;
    }

    usbd_event_ep_in_complete_handler(busid, 0x80u, completed);
    if (!s_dcd.in_ep[0].active && !s_dcd.out_ep[0].active) {
        x035_usb_arm_setup();
    }
}

static void x035_usb_complete_ep0_out(uint8_t busid, uint8_t intst) {
    x035_usb_ep_state_t *state = &s_dcd.out_ep[0];
    uint16_t packet_len = USBFSD->RX_LEN;
    uint32_t copy_len;

    (void)intst;
    /* X035 EP0 OUT 完成中断不保证报告 TOG_OK */
    if (!state->active) {
        return;
    }

    x035_usb_set_rx_response(0u, USBFS_UEP_R_RES_NAK);
    if (packet_len > X035_USB_EP_MPS) {
        packet_len = X035_USB_EP_MPS;
    }
    copy_len = x035_usb_min(packet_len, state->remaining);
    if (copy_len != 0u) {
        memcpy(state->buffer, s_dcd.ep0_4_buffer, copy_len);
    }

    state->active = false;
    state->buffer = NULL;
    state->remaining = 0u;
    state->packet_len = 0u;
    s_dcd.ep0_rx_toggle = packet_len == state->mps ? !s_dcd.ep0_rx_toggle : true;
    usbd_event_ep_out_complete_handler(busid, 0u, copy_len);
    if (!s_dcd.in_ep[0].active && !s_dcd.out_ep[0].active) {
        x035_usb_arm_setup();
    }
}

static void x035_usb_handle_setup(uint8_t busid) {
    x035_usb_reset_transfer(&s_dcd.in_ep[0]);
    x035_usb_reset_transfer(&s_dcd.out_ep[0]);
    s_dcd.in_ep[0].stalled = false;
    s_dcd.out_ep[0].stalled = false;
    s_dcd.address_pending = false;
    x035_usb_set_tx_ctrl(0u, USBFS_UEP_T_TOG | USBFS_UEP_T_RES_NAK);
    x035_usb_set_rx_ctrl(0u, USBFS_UEP_R_TOG | USBFS_UEP_R_RES_NAK);
    s_dcd.ep0_rx_toggle = true;
    s_dcd.ep0_tx_toggle = true;
    usbd_event_ep0_setup_complete_handler(busid, (uint8_t *)&s_dcd.setup);
}

static void x035_usb_handle_bus_reset(uint8_t busid) {
    memset(&s_dcd, 0, sizeof(s_dcd));
    USBFSD->DEV_ADDR = 0u;
    x035_usb_reset_endpoint_registers();
    x035_usb_setup_dma_buffers();
    usbd_event_reset_handler(busid);
    x035_usb_arm_setup();
}

__WEAK void usb_dc_low_level_init(void) {
}

__WEAK void usb_dc_low_level_deinit(void) {
}

__WEAK void usb_dc_delay_us(uint32_t us) {
    volatile uint32_t count = us * 100u;

    while (count-- != 0u) {
        __asm__ volatile("nop");
    }
}

int usb_dc_init(uint8_t busid) {
    uint8_t int_en = USBFS_UIE_SUSPEND | USBFS_UIE_BUS_RST | USBFS_UIE_TRANSFER;

