0wQ/ch32x035-usb-wchlink/third_party/cherryusb_port/usb_ch32x035_dc_usbfs.c
    if (!x035_usb_bus_valid(busid)) {
        return -USB_ERR_INVAL;
    }

    usb_dc_low_level_init();
    USBFSD->INT_EN = 0u;
    USBFSD->UDEV_CTRL = 0u;
    memset(&s_dcd, 0, sizeof(s_dcd));

    USBFSD->BASE_CTRL = USBFS_UC_RESET_SIE | USBFS_UC_CLR_ALL;
    usb_dc_delay_us(10u);
    USBFSD->BASE_CTRL = 0u;
    x035_usb_reset_endpoint_registers();
    x035_usb_setup_dma_buffers();
    x035_usb_arm_setup();

#ifdef CONFIG_USBDEV_SOF_ENABLE
    int_en |= USBFS_UIE_DEV_SOF;
#endif
    USBFSD->DEV_ADDR = 0u;
    USBFSD->INT_FG = 0xffu;
    USBFSD->INT_EN = int_en;
    USBFSD->BASE_CTRL = USBFS_UC_DEV_PU_EN | USBFS_UC_INT_BUSY | USBFS_UC_DMA_EN;
    USBFSD->UDEV_CTRL = USBFS_UD_PD_DIS | USBFS_UD_PORT_EN;
    return 0;
}

int usb_dc_deinit(uint8_t busid) {
    if (!x035_usb_bus_valid(busid)) {
        return -USB_ERR_INVAL;
    }

    USBFSD->INT_EN = 0u;
    USBFSD->UDEV_CTRL = 0u;
    USBFSD->BASE_CTRL = USBFS_UC_RESET_SIE | USBFS_UC_CLR_ALL;
    usb_dc_delay_us(10u);
    USBFSD->BASE_CTRL = 0u;
    USBFSD->UEP4_1_MOD = 0u;
    USBFSD->UEP2_3_MOD = 0u;
    USBFSD->UEP567_MOD = 0u;
    memset(&s_dcd, 0, sizeof(s_dcd));
    usb_dc_low_level_deinit();
    return 0;
}

int usbd_set_address(uint8_t busid, const uint8_t address) {
    if (!x035_usb_bus_valid(busid) || address > USBFS_USB_ADDR_MASK) {
        return -USB_ERR_INVAL;
    }

    if (address == 0u) {
        USBFSD->DEV_ADDR &= USBFS_UDA_GP_BIT;
        s_dcd.address_pending = false;
    } else {
        s_dcd.pending_address = address;
        s_dcd.address_pending = true;
    }
    return 0;
}

int usbd_set_remote_wakeup(uint8_t busid) {
    if (!x035_usb_bus_valid(busid)) {
        return -USB_ERR_INVAL;
    }

    USBFSD->UDEV_CTRL |= USBFS_UD_LOW_SPEED;
    usb_dc_delay_us(8000u);
    USBFSD->UDEV_CTRL &= (uint8_t)~USBFS_UD_LOW_SPEED;
    usb_dc_delay_us(1000u);
    return 0;
}

uint8_t usbd_get_port_speed(uint8_t busid) {
    return x035_usb_bus_valid(busid) ? USB_SPEED_FULL : USB_SPEED_UNKNOWN;
}

int usbd_ep_open(uint8_t busid, const struct usb_endpoint_descriptor *ep) {
    uint8_t ep_idx;
    uint8_t ep_type;
    uint16_t mps;
    bool in;
    x035_usb_ep_state_t *state;
    x035_usb_ep_state_t *opposite;

    if (!x035_usb_bus_valid(busid) || ep == NULL || (ep->bEndpointAddress & 0x70u) != 0u) {
        return -USB_ERR_INVAL;
    }

    ep_idx = USB_EP_GET_IDX(ep->bEndpointAddress);
    ep_type = USB_GET_ENDPOINT_TYPE(ep->bmAttributes);
    mps = USB_GET_MAXPACKETSIZE(ep->wMaxPacketSize);
    in = USB_EP_DIR_IS_IN(ep->bEndpointAddress);
    if (!x035_usb_ep_valid(ep_idx) || mps == 0u || mps > X035_USB_EP_MPS ||
        (ep_idx == 0u && ep_type != USB_ENDPOINT_TYPE_CONTROL) ||
        (ep_idx != 0u && ep_type == USB_ENDPOINT_TYPE_CONTROL)) {
        return -USB_ERR_INVAL;
    }

    state = in ? &s_dcd.in_ep[ep_idx] : &s_dcd.out_ep[ep_idx];
    opposite = in ? &s_dcd.out_ep[ep_idx] : &s_dcd.in_ep[ep_idx];
    if (state->active || (ep_idx != 0u && opposite->active && !x035_usb_mode_enabled(ep_idx, in))) {
        return -USB_ERR_BUSY;
    }

    x035_usb_reset_transfer(state);
    state->mps = mps;
    state->type = ep_type;
    state->enabled = true;
    state->stalled = false;

    if (ep_idx == 0u) {
        if (in) {
            x035_usb_set_tx_ctrl(0u, USBFS_UEP_T_RES_NAK);
        } else {
            x035_usb_set_rx_ctrl(0u, USBFS_UEP_R_RES_NAK);
        }
        return 0;
    }

    x035_usb_restore_dma(ep_idx);
    x035_usb_set_mode(ep_idx, in, true);
    if (in) {
        *x035_usb_tx_len_reg(ep_idx) = 0u;
        x035_usb_set_tx_ctrl(ep_idx,
                             (x035_usb_auto_toggle_supported(ep_idx)
                                  ? USBFS_UEP_T_AUTO_TOG
                                  : 0u) |
                                 USBFS_UEP_T_RES_NAK);
    } else {
        x035_usb_set_rx_ctrl(ep_idx,
                             (x035_usb_auto_toggle_supported(ep_idx)
                                  ? USBFS_UEP_R_AUTO_TOG
                                  : 0u) |
                                 USBFS_UEP_R_RES_NAK);
    }
    return 0;
}

int usbd_ep_close(uint8_t busid, const uint8_t ep) {
    uint8_t ep_idx = USB_EP_GET_IDX(ep);
    bool in = USB_EP_DIR_IS_IN(ep);
    x035_usb_ep_state_t *state;
    x035_usb_ep_state_t *opposite;

    if (!x035_usb_bus_valid(busid) || (ep & 0x70u) != 0u || !x035_usb_ep_valid(ep_idx)) {
        return -USB_ERR_INVAL;
    }
    if (ep_idx == 0u) {
        return 0;
    }

    state = in ? &s_dcd.in_ep[ep_idx] : &s_dcd.out_ep[ep_idx];
    opposite = in ? &s_dcd.out_ep[ep_idx] : &s_dcd.in_ep[ep_idx];
    if (in) {
        *x035_usb_tx_len_reg(ep_idx) = 0u;
        x035_usb_set_tx_ctrl(ep_idx, USBFS_UEP_T_RES_NAK);
    } else {
        x035_usb_set_rx_ctrl(ep_idx, USBFS_UEP_R_RES_NAK);
    }
    memset(state, 0, sizeof(*state));

    if (!opposite->active) {
        x035_usb_set_mode(ep_idx, in, false);
        x035_usb_restore_dma(ep_idx);
    }
    return 0;
}

int ch32x035_usbd_ep_abort_in(uint8_t busid, uint8_t ep) {
    uint8_t ep_idx = USB_EP_GET_IDX(ep);
    x035_usb_ep_state_t *state;

    if (!x035_usb_bus_valid(busid) || !USB_EP_DIR_IS_IN(ep) || (ep & 0x70u) != 0u ||
        ep_idx == 0u || !x035_usb_ep_valid(ep_idx)) {
        return -USB_ERR_INVAL;
    }

    state = &s_dcd.in_ep[ep_idx];
    if (!state->enabled || state->stalled) {
        return -USB_ERR_NOTCONN;
    }

    // 新命令到达时废弃旧回复，保持 toggle 让下一包沿用当前 Bulk 会话
    x035_usb_reset_transfer(state);
    *x035_usb_tx_len_reg(ep_idx) = 0u;
    x035_usb_set_tx_response(ep_idx, USBFS_UEP_T_RES_NAK);
    return 0;
}

void ch32x035_usbd_set_ep_in_toggle(uint8_t busid, uint8_t ep, bool toggle) {
    uint8_t ep_idx = USB_EP_GET_IDX(ep);

    if (!x035_usb_bus_valid(busid) || !USB_EP_DIR_IS_IN(ep) || (ep & 0x70u) != 0u ||
        ep_idx == 0u || !x035_usb_ep_valid(ep_idx)) {
        return;
    }
    x035_usb_set_tx_ctrl(ep_idx,
                         (x035_usb_get_tx_ctrl(ep_idx) & (uint8_t)~USBFS_UEP_T_TOG) |
                             (toggle ? USBFS_UEP_T_TOG : 0u));
}

