0wQ/ch32x035-usb-wchlink/third_party/cherryusb_port/usb_ch32x035_dc_usbfs.c
void ch32x035_usbd_toggle_ep_in_toggle(uint8_t busid, uint8_t ep) {
    uint8_t ep_idx = USB_EP_GET_IDX(ep);

    if (!x035_usb_bus_valid(busid) || !USB_EP_DIR_IS_IN(ep) || (ep & 0x70u) != 0u ||
        ep_idx == 0u || !x035_usb_ep_valid(ep_idx)) {
        return;
    }
    x035_usb_set_tx_ctrl(ep_idx, x035_usb_get_tx_ctrl(ep_idx) ^ USBFS_UEP_T_TOG);
}

void ch32x035_usbd_set_ep_out_toggle(uint8_t busid, uint8_t ep, bool toggle) {
    uint8_t ep_idx = USB_EP_GET_IDX(ep);

    if (!x035_usb_bus_valid(busid) || !USB_EP_DIR_IS_OUT(ep) || (ep & 0x70u) != 0u ||
        ep_idx == 0u || !x035_usb_ep_valid(ep_idx)) {
        return;
    }
    x035_usb_set_rx_ctrl(ep_idx,
                         (x035_usb_get_rx_ctrl(ep_idx) & (uint8_t)~USBFS_UEP_R_TOG) |
                             (toggle ? USBFS_UEP_R_TOG : 0u));
}

void ch32x035_usbd_set_ep_out_toggle_resync(uint8_t busid, uint8_t ep, bool enable) {
    uint8_t ep_idx = USB_EP_GET_IDX(ep);

    if (!x035_usb_bus_valid(busid) || !USB_EP_DIR_IS_OUT(ep) || (ep & 0x70u) != 0u ||
        ep_idx == 0u || !x035_usb_ep_valid(ep_idx)) {
        return;
    }
    s_dcd.out_ep[ep_idx].accept_toggle_mismatch = enable;
}

int usbd_ep_set_stall(uint8_t busid, const uint8_t ep) {
    uint8_t ep_idx = USB_EP_GET_IDX(ep);
    bool in = USB_EP_DIR_IS_IN(ep);
    x035_usb_ep_state_t *state;

    if (!x035_usb_bus_valid(busid) || (ep & 0x70u) != 0u || !x035_usb_ep_valid(ep_idx)) {
        return -USB_ERR_INVAL;
    }

    state = in ? &s_dcd.in_ep[ep_idx] : &s_dcd.out_ep[ep_idx];
    state->stalled = true;
    x035_usb_reset_transfer(state);
    if (in) {
        *x035_usb_tx_len_reg(ep_idx) = 0u;
        x035_usb_set_tx_ctrl(ep_idx,
                             (x035_usb_auto_toggle_supported(ep_idx)
                                  ? USBFS_UEP_T_AUTO_TOG
                                  : 0u) |
                                 USBFS_UEP_T_TOG | USBFS_UEP_T_RES_STALL);
    } else {
        x035_usb_set_rx_ctrl(ep_idx,
                             (x035_usb_auto_toggle_supported(ep_idx)
                                  ? USBFS_UEP_R_AUTO_TOG
                                  : 0u) |
                                 USBFS_UEP_R_TOG | USBFS_UEP_R_RES_STALL);
    }

    if (ep_idx == 0u) {
        x035_usb_restore_dma(0u);
        if (in) {
            x035_usb_set_rx_ctrl(0u, USBFS_UEP_R_RES_ACK);
        }
    }
    return 0;
}

int usbd_ep_clear_stall(uint8_t busid, const uint8_t ep) {
    uint8_t ep_idx = USB_EP_GET_IDX(ep);
    bool in = USB_EP_DIR_IS_IN(ep);
    x035_usb_ep_state_t *state;

    if (!x035_usb_bus_valid(busid) || (ep & 0x70u) != 0u || !x035_usb_ep_valid(ep_idx)) {
        return -USB_ERR_INVAL;
    }

    state = in ? &s_dcd.in_ep[ep_idx] : &s_dcd.out_ep[ep_idx];
    state->stalled = false;
    x035_usb_reset_transfer(state);
    if (ep_idx == 0u) {
        x035_usb_arm_setup();
    } else if (in) {
        *x035_usb_tx_len_reg(ep_idx) = 0u;
        // 清除 halt 后从 DATA0 开始新的端点会话
        x035_usb_set_tx_ctrl(ep_idx,
                             (x035_usb_get_tx_ctrl(ep_idx) &
                              (uint8_t)~USBFS_UEP_T_TOG) |
                                 USBFS_UEP_T_RES_NAK);
    } else {
        x035_usb_set_rx_ctrl(ep_idx,
                             (x035_usb_get_rx_ctrl(ep_idx) &
                              (uint8_t)~USBFS_UEP_R_TOG) |
                                 USBFS_UEP_R_RES_NAK);
    }
    return 0;
}

int usbd_ep_is_stalled(uint8_t busid, const uint8_t ep, uint8_t *stalled) {
    uint8_t ep_idx = USB_EP_GET_IDX(ep);

    if (!x035_usb_bus_valid(busid) || stalled == NULL || (ep & 0x70u) != 0u ||
        !x035_usb_ep_valid(ep_idx)) {
        return -USB_ERR_INVAL;
    }

    *stalled = USB_EP_DIR_IS_IN(ep) ? s_dcd.in_ep[ep_idx].stalled : s_dcd.out_ep[ep_idx].stalled;
    return 0;
}

int usbd_ep_start_write(uint8_t busid, const uint8_t ep, const uint8_t *data, uint32_t data_len) X035_USBFS_HIGHCODE_ATTR __attribute__((noinline));
int usbd_ep_start_write(uint8_t busid, const uint8_t ep, const uint8_t *data, uint32_t data_len) {
    uint8_t ep_idx = USB_EP_GET_IDX(ep);
    x035_usb_ep_state_t *state;

    if (!x035_usb_bus_valid(busid) || !USB_EP_DIR_IS_IN(ep) || (ep & 0x70u) != 0u ||
        !x035_usb_ep_valid(ep_idx) || (data == NULL && data_len != 0u)) {
        return -USB_ERR_INVAL;
    }

    state = &s_dcd.in_ep[ep_idx];
    if (!state->enabled || state->stalled) {
        return -USB_ERR_NOTCONN;
    }
    if (state->active) {
        return -USB_ERR_BUSY;
    }

    state->active = true;
    state->buffer = (uint8_t *)data;
    state->remaining = data_len;
    state->transferred = 0u;
    state->packet_len = 0u;
    state->dma_direct = false;

    if (ep_idx == 0u) {
        uint32_t count = x035_usb_min(data_len, state->mps);

        state->packet_len = (uint16_t)count;
        if (count != 0u) {
            x035_usb_restore_dma(0u);
            memcpy(s_dcd.ep0_4_buffer, data, count);
        }
        *x035_usb_tx_len_reg(0u) = (uint16_t)count;
        x035_usb_dma_fence();
        x035_usb_set_tx_ctrl(0u, (s_dcd.ep0_tx_toggle ? USBFS_UEP_T_TOG : 0u) | USBFS_UEP_T_RES_ACK);
        return 0;
    }

    x035_usb_load_in_packet(ep_idx);
    return 0;
}

int usbd_ep_start_read(uint8_t busid, const uint8_t ep, uint8_t *data, uint32_t data_len) X035_USBFS_HIGHCODE_ATTR __attribute__((noinline));
int usbd_ep_start_read(uint8_t busid, const uint8_t ep, uint8_t *data, uint32_t data_len) {
    uint8_t ep_idx = USB_EP_GET_IDX(ep);
    x035_usb_ep_state_t *state;

    if (!x035_usb_bus_valid(busid) || !USB_EP_DIR_IS_OUT(ep) || (ep & 0x70u) != 0u ||
        !x035_usb_ep_valid(ep_idx) || (data == NULL && data_len != 0u)) {
        return -USB_ERR_INVAL;
    }

    state = &s_dcd.out_ep[ep_idx];
    if (!state->enabled || state->stalled) {
        return -USB_ERR_NOTCONN;
    }
    if (state->active) {
        return -USB_ERR_BUSY;
    }
    if (ep_idx != 0u && data_len == 0u) {
        return -USB_ERR_INVAL;
    }

    state->active = true;
    state->buffer = data;
    state->remaining = data_len;
    state->transferred = 0u;
    state->packet_len = 0u;
    state->dma_direct = false;

    if (ep_idx == 0u) {
        x035_usb_restore_dma(0u);
        x035_usb_set_rx_ctrl(0u, (s_dcd.ep0_rx_toggle ? USBFS_UEP_R_TOG : 0u) | USBFS_UEP_R_RES_ACK);
        return 0;
    }

    x035_usb_arm_out_packet(ep_idx);
    return 0;
}

void USBD_IRQHandler(uint8_t busid) {
    uint8_t intflag;

