0wQ/ch32x035-usb-wchlink/third_party/cherryusb_port/usb_ch32x035_dc_usbfs.c
    if (!x035_usb_bus_valid(busid)) {
        return;
    }

    intflag = USBFSD->INT_FG;
    if ((intflag & USBFS_UIF_BUS_RST) != 0u) {
        USBFSD->INT_FG = USBFS_UIF_BUS_RST | (intflag & USBFS_UIF_TRANSFER);
        x035_usb_handle_bus_reset(busid);
        return;
    }

    if ((intflag & USBFS_UIF_TRANSFER) != 0u) {
        uint8_t intst = USBFSD->INT_ST;
        uint8_t ep_idx = intst & USBFS_UIS_ENDP_MASK;

        switch (intst & USBFS_UIS_TOKEN_MASK) {
            case USBFS_UIS_TOKEN_SETUP:
                /* SETUP is always handled by EP0; X035 endpoint bits may be stale here. */
                x035_usb_handle_setup(busid);
                break;

            case USBFS_UIS_TOKEN_IN:
                if (ep_idx == 0u) {
                    x035_usb_complete_ep0_in(busid, intst);
                } else if (x035_usb_ep_valid(ep_idx)) {
                    x035_usb_complete_noncontrol_in(busid, ep_idx, intst);
                }
                break;

            case USBFS_UIS_TOKEN_OUT:
                if (ep_idx == 0u) {
                    x035_usb_complete_ep0_out(busid, intst);
                } else if (x035_usb_ep_valid(ep_idx)) {
                    x035_usb_complete_noncontrol_out(busid, ep_idx, intst);
                }
                break;

            case USBFS_UIS_TOKEN_SOF:
#ifdef CONFIG_USBDEV_SOF_ENABLE
                usbd_event_sof_handler(busid);
#endif
                break;

            default:
                break;
        }
        USBFSD->INT_FG = USBFS_UIF_TRANSFER;
        return;
    }

    if ((intflag & USBFS_UIF_SUSPEND) != 0u) {
        USBFSD->INT_FG = USBFS_UIF_SUSPEND;
        if ((USBFSD->MIS_ST & USBFS_UMS_SUSPEND) != 0u) {
            usbd_event_suspend_handler(busid);
        } else {
            usbd_event_resume_handler(busid);
        }
        return;
    }

    USBFSD->INT_FG = intflag;
}

void USBFS_IRQHandler(void) X035_USBFS_IRQ_ATTR X035_USBFS_HIGHCODE_ATTR;
void USBFS_IRQHandler(void) {
    USBD_IRQHandler(0u);
}
